[
  "Does the child respond to his/her name when called?",
  "Does the child maintain eye contact when interacting with others?",
  "Does the child smile back when you smile at him/her?",
  "Does the child enjoy being cuddled or touched?",
  "Does the child show interest in other children?",
  "Does the child make eye contact with people around him/her?",
  "Does the child exhibit unusual responses to sounds (e.g., ignoring, covering ears)?",
  "Does the child point or gesture to indicate interest?",
  "Does the child bring objects to show to others?",
  "Does the child respond to simple verbal requests (e.g., 'come here')?",
  "Does the child imitate other people's actions (e.g., clapping, waving)?",
  "Does the child use gestures meaningfully (e.g., nodding for yes)?",
  "Does the child look in the direction of sounds or pointing?",
  "Does the child show facial expressions that match the context (e.g., happy, sad)?",
  "Does the child engage in pretend play (e.g., feeding a doll)?",
  "Does the child show repetitive movements (e.g., hand flapping, rocking)?",
  "Does the child line up objects or toys excessively?",
  "Does the child show sensitivity to certain textures, lights, or smells?",
  "Does the child insist on following specific routines or rituals?",
  "Does the child react unusually to pain or temperature (e.g., doesn't cry when hurt)?",
  "Does the child speak clearly and meaningfully for his/her age?",
  "Does the child echo words or phrases repeatedly (echolalia)?",
  "Does the child use language to communicate needs and feelings?",
  "Does the child respond when spoken to?",
  "Does the child initiate conversation?",
  "Does the child repeat questions instead of answering them?",
  "Does the child ask questions to gather information?",
  "Does the child use appropriate pronouns (e.g., 'I', 'you')?",
  "Does the child show understanding of what is said to him/her?",
  "Does the child follow two-step instructions (e.g., 'pick the toy and give it to me')?",
  "Does the child display aggressive behaviors (e.g., hitting, biting)?",
  "Does the child have temper tantrums frequently?",
  "Does the child show inappropriate attachment to objects?",
  "Does the child show signs of hyperactivity or inattention?",
  "Does the child harm him/herself (e.g., head banging, biting)?",
  "Does the child show poor motor coordination (e.g., tripping, clumsy)?",
  "Does the child stare at lights, spinning objects, or hands?",
  "Does the child walk on toes frequently?",
  "Does the child have unusual fears or lack of fear?",
  "Does the child avoid or resist being hugged or held?"
]